resources/TransferComplete.xml

<soap:Envelope
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:cwmp="urn:dslforum-org:cwmp-1-1">
<soap:Header>
</soap:Header>
<soap:Body>
<cwmp:TransferComplete>
<CommandKey>12345</CommandKey>
<FaultStruct>
<FaultCode>9001</FaultCode>
<FaultString>Foobar</FaultString>
</FaultStruct>
<StartTime>2012-07-13T19:11:11+08:00</StartTime>
<CompleteTime>2012-07-13T20:11:11+08:00</CompleteTime>
</cwmp:TransferComplete>
</soap:Body>
</soap:Envelope>